tips = [
        # 正经的Tips
        '点我是可以刷新Tips哒ヾ(•ω•`)o',
        '在列表框中可以按住 Ctrl 进行点选',
        '在列表框中可以按住 Shift 进行区间选择',
        '启动时使用 -debug 可以显示调试信息',
        '如果程序崩溃，不妨去安装目录下查看生成的崩溃日志',
        # neta以及一些奇奇怪怪的东西
        '此程序还不完善，使用前请做好被Bug雷普的心理准备（',
        '欢迎使用基于Bug开发的BiliTools（',
        'Bug是此程序的重要组成部分，请勿修复（误',
        '有一个程序员前来修Bug',
        '我好不容易写好一次，你却崩溃得这么彻底',
        '（`Oω|',
        '啊哈哈哈哈，我滴程序完成辣！',
        '「世界」——！',
        'Damedane~dameyo~',
        'Ciallo～(∠・ω< )⌒☆',
        '不写注释一时爽，维护程序火葬场',
        '让我看看你的程序正不正常啊♂',
        '✝升天✝✝升天✝✝升天✝',# 小天使请安！！
        '✝In Hell We Live, Lament✝',
        '不要停下来啊（指修Bug',
        'Verify Code: 0d00 0721（？）',
        '请各位顾客不要在酒吧点炒饭（恼）',
        'んなぁ～',
        '今日份TODO：去码头搞点薯条（',
        # 谷歌娘の名言
        # 待填充
        # 不正经的引用
        '「不可能不可能不可能不可能这一定是梦」',
        '「……这个生物是怎么回事啊，从刚才开始就好萌」',
        '「这个遥控器是……房间的起爆装置！」',
        '「我很生气，好气好气的」',
        '「有见识的人说过，OP里有跳跃画面的动画一定是神作。」',# 《孤独摇滚》（凉）
        # 正经引用，但全是私货（匹老板，我的人生导师）
        '「对嘲讽无需慈悲之心。」', # 《Sabbat of Witch》 假屋和奏
        '「你的生命不是为了飘散而绽放的。」',# 《抚子色心灵》
        '「来吧，乘风破浪，将世俗的眼光统统超越。」',# （同上）
        '「心中怀抱着存在，就这样逐渐融化进晚霞中。」',# 《我们大家都是意义不明的存在》
        '「向着那一日所梦之景，纵身飞翔。」',# 《折翼天使的安魂曲》
        '「我就是不要做人啦！！」',# 《我讨厌人类》
        '「如果明天也活着就好啦。」',# 《像阎魔大王说的那样》
        '「你也是坏人，真是太好了。」',
        '「在各自的心底，一定会闪耀属于各自独一无二的光辉。」',# 《Fireworks+》
        '「全人类都做自己喜欢的事，世界就会灭亡。」',# 《我只要我喜欢的事物》
        '「如果只用开心的事和无聊的事能够填饱肚子，就好啦。」',# 《Mei Mei》
        '「即使讨厌做人，也还是不能停止。」',# 《SAYONARA HUMAN》
        '「不论什么事情，都是某样东西的错呢。」',# 《玉葱+》
        '「剥掉外皮大家都是一样的，各位。」',# 《What's Inside》
        '「放心总会有办法的，迎向明天吧。」',# 《サイケデリックスマイル+》
        '「一定要活下去，直到某日绽放笑容。」',
        '「为了回应别人的期待而郁郁寡欢，多无趣啊。」',
        '「奔跑不停的少年啊，直到来世也别止步。」',# 《乐土少年的传说》
        '「生命不过一瞬，歌声却留永恒。」',# （同上）
        '「我要亲眼见到黎明的曙光！」',# （同上）
        '「这颗心，如同抬头所见的天空般，流光璨璨。」',# 《爱的流星》
        '「当爱超越时间，我们将再次相见。」',# （同上）
        '「要是放弃了个性，就跟死去没两样。」',# 《孤独摇滚》（凉）
        '「继续前行，因为未来呀，就在那里等我。」',# 《Lockdown》
        '「真正的天空，广阔且无论到哪里都紧紧相连。」',# 《缘之空》
        '「我不会顾忌任何，因为我早已下定决心。」',# 《Endless Embrace》
        '「我要凝视之物，存在于黑暗之中。」',# 《Made in Abyss》 S2EP1 12:30
        '「若不跨越最深的黑暗，便无法迎来黎明。」',# 《Made in Abyss》 Movie 10:30
        '「考验会使爱更加深厚。」',# 《Made in Abyss》 Movie 52:08
        '「祝你们的旅途，充满了诅咒与幸福。」',# 《Made in Abyss》 Movie 1:33:54
        '「万丈曙光之下，我们走上这条路，践行命运，追逐希望。」',# 《Forever Lost》
        '「向着崭新黎明，我们踏上这征途。」',# （同上）
        '「愿悲伤退散，望痛苦消逝。」',# （同上）
        '「捡起来的一切，都将成为你的价值。」',# 《Made in Abyss》 S2EP10 6:35
        '「你做不到最好，你只能下次做得更好。」',# Arknights Provence module 1
        '「我们所度过的每个平凡的日常，也许就是连续发生的奇迹。」',# 《日常》
        '「勇士啊，光芒与你同在。」', # Blue Archive - Tendou Arisu
        '「有趣的事现在开始！」' #Blue Archive - Saiba Momoi
        ]

# 大量私货（

about_info = '\n'.join([
    'BiliTools v.{version}',
    '一些功能需要 FFmpeg 和 FFplay 的支持.',
    'Made by: @NingmengLemon (GitHub)',
    '引用开源程序: danmaku2ass',
    '更多信息可以去GitHub页面查看.',
    '---------------------------',
    '使用本程序是你个人的自愿行为，使用本程序所造成的一切风险和不良后果均与作者本人无关.',
    '感谢您的使用.'
    ])

