tips = [
        '欢迎使用基于Bug开发的BiliTools（',
        'Bug是此程序的重要组成部分，请勿删除（误',
        '你知道吗，其实此程序的作者是只鸽子（认真脸',
        '有一个程序员前来修Bug',
        '我好不容易写好一次，你却崩溃得这么彻底',
        '（`Oω|',
        '点我是可以刷新Tips哒ヾ(•ω•`)o',
        '啊哈哈哈哈，我滴程序完成辣！',
        '「世界」——！',
        'Damedane~dameyo~',
        '不写注释一时爽，维护程序火葬场',
        '让我看看你的程序正不正常啊♂',
        '✝升天✝✝升天✝✝升天✝',#小天使请安！！
        '《程序员的取悦手段》',#neta自《妖怪的取悦手段》
        '「你的生命不是为了飘散而绽放的。」',#《抚子色心灵》
        '「来吧，乘风破浪，将世俗的眼光统统超越。」',#《抚子色心灵》
        '「你没有活着真是太好了。」',#《你没有活着真是太好了》
        '「心中怀抱着存在，就这样逐渐融化进晚霞中。」',#《我们大家都是意义不明的存在》
        '「向着那一日所梦之景，纵身飞翔。」',#《折翼天使的安魂曲》
        '「我就是不要做人啦！！」',#《我讨厌人类》
        '「如果明天也活着就好啦。」',#《像阎魔大王说的那样》
        '「你也是坏人，真是太好了。」',
        '「一如既往的归途，却是如此的漫长。」',#《一个人的归途》
        '「不要被扭曲的爱所欺骗。」',
        '「要是能更加的 活得像样点儿该有多好啊。」',#《Sick Sick Sick》
        '「所以呢？即使是撒谎也真心的回答了"YES"的意见征询。」',#《司空见惯的世界征服》
        '「沾满口水的八卦消息，大家全吃得满嘴黏糊糊的。」',#《该死的异端及巧克力》
        '「在各自的心底，一定会闪耀属于各自独一无二的光辉。」',#《Fireworks》
        '「找到了，快要忘掉的有趣事。」',#《初次见面地球人》
        '「全人类都做自己喜欢的事，世界就会灭亡。」',#《我只要我喜欢的事物》
        '「如果只用开心的事和无聊的事能够填饱肚子，就好啦。」',#《Mei Mei》
        '「即使讨厌做人，也还是不能停止。」',#《SAYONARA HUMAN》
        '「不论什么事情，都是某样东西的错呢。」',#《玉葱》
        '「剥掉外皮大家都是一样的，各位。」',#《What's Inside》
        '「放心总会有办法的，迎向明日吧。」',#《迷幻的微笑》
        ]

#大量私货（
